In [14]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
from scipy.stats import norm
from pandas import Series,DataFrame
#from sklearn.preprocessing import StandardScaler
from scipy import stats
import warnings
warnings.filterwarnings('ignore')
%matplotlib inline

In [15]:
arr = np.array([[1,2,3],[np.nan,5,6],[7,np.nan,8],[np.nan,np.nan,np.nan]])
arr

array([[ 1.,  2.,  3.],
       [nan,  5.,  6.],
       [ 7., nan,  8.],
       [nan, nan, nan]])

In [16]:
df = DataFrame(arr)

In [18]:
df.dropna(axis=1)
df.dropna(how="all")

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [20]:
df.dropna(how='all')

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  8.0

In [26]:
df.dropna(thresh=2) #It is with resspect to Not Null or It should have atleast 1,2,3 onwards datapoints

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  8.0

In [28]:
dframe = DataFrame(np.arange(16).reshape(4,4),index=[[1,1,2,2],['a','b','c','d']])
dframe

      0   1   2   3
1 a   0   1   2   3
  b   4   5   6   7
2 c   8   9  10  11
  d  12  13  14  15

In [31]:
dframe = DataFrame(np.arange(16).reshape(4,4),index=[[1,1,2,2],['a','b','c','d']],
                  columns = [['Ban','Nag','Nag','Nag'],['Cold','Hot','Cold','Rainy']])
dframe

     Ban Nag
    Cold Hot Cold Rainy
1 a    0   1    2     3
  b    4   5    6     7
2 c    8   9   10    11
  d   12  13   14    15

In [32]:
dframe['Ban']

     Cold
1 a     0
  b     4
2 c     8
  d    12

In [33]:
dframe['Nag']

     Hot  Cold  Rainy
1 a    1     2      3
  b    5     6      7
2 c    9    10     11
  d   13    14     15

In [34]:
dframe['Nag','Cold'][1]

a    2
b    6
Name: (Nag, Cold), dtype: int32

In [35]:
dframe['Nag','Cold'][1,'b']

6

In [48]:
Ser1 = Series([1,2,3,4,np.nan],index=('a','b','c','d','e'))
Ser2 = Series([3,np.nan,4,np.nan,np.nan],index=('a','b','c','d','e'))

In [60]:
Ser1

a    1.0
b    2.0
c    3.0
d    4.0
e    NaN
dtype: float64

In [61]:
Ser2

a    3.0
b    NaN
c    4.0
d    NaN
e    NaN
dtype: float64

In [64]:
ser3 = np.where(Ser2.isnull(),Ser1,Ser2)
b = Series(Ser3,index=Ser1.index)
b

a    2.0
b    NaN
c    1.0
d    NaN
e    NaN
dtype: float64

In [65]:
Ser1.combine_first(Ser2)

a    1.0
b    2.0
c    3.0
d    4.0
e    NaN
dtype: float64

In [71]:
import pandas as pd
data = [['A',2],['A',2],['B',2],['B',3],['B',3]]
df = pd.DataFrame(data,columns=['key1','key2'])
df

  key1  key2
0    A     2
1    A     2
2    B     2
3    B     3
4    B     3

In [72]:
df.duplicated()

0    False
1     True
2    False
3    False
4     True
dtype: bool

In [80]:
df.drop_duplicates('key1')

  key1  key2
0    A     2
2    B     2

In [83]:
df.drop_duplicates('key1',keep='first')

  key1  key2
0    A     2
2    B     2

In [84]:
import pandas as pd
data = [['Gaurav',100],['Debashish',200],['Aujasvi',85]]
df = pd.DataFrame(data,columns=['names','weights'])
df

       names  weights
0     Gaurav      100
1  Debashish      200
2    Aujasvi       85

In [85]:
Height_map = {'Gaurav': 50, 'Debashish': 60, 'Aujasvi': 70} 
Height_map

{'Gaurav': 50, 'Debashish': 60, 'Aujasvi': 70}

In [90]:
df['Heights']= df["names"].map(Height_map)

In [91]:
df

       names  weights  Heights
0     Gaurav      100       50
1  Debashish      200       60
2    Aujasvi       85       70